A-KL/esp32-projects/remote-control/motor-controller-mini/include/ps3_input.h
#pragma once

#include <esp32-hal-log.h>
#include <driver_config.h>
#include <inputs_queue.h>

#define INPUT_PS_RANGE      255
#define INPUT_PS_HALF_RANGE 0
#define INPUT_PS_MIN        -127
#define INPUT_PS_MAX        127

#define INPUT_PS_DEAD_ZONE  16

#ifdef HAS_BLUETOOTH

#include <Ps3Controller.h>

static queue_t<ps3_t> ps_input_queue;

inline int16_t ps3_trim(int16_t value)
{
    return abs(value) > INPUT_PS_DEAD_ZONE ? value : INPUT_PS_HALF_RANGE;
}

void ps3_on_connect() 
{
    log_i("PS3 Controller Connected.");
    Ps3.setPlayer(1);
}

void ps3_on_disconnect() 
{
    log_e("PS3 Controller connection lost.");
}

void ps3_on_data_received() 
{
   queue_send(ps_input_queue, Ps3.data);
}

#endif

inline void ps3_init() 
{
#ifdef HAS_BLUETOOTH
    Ps3.attach(ps3_on_data_received);
    Ps3.attachOnConnect(ps3_on_connect);
    Ps3.attachOnDisconnect(ps3_on_disconnect);

    if (Ps3.begin(ps_controller_mac)) {
        log_i("Ps3 initialization...OK");
    }   
    else {
        log_w("Ps3 initialization...FAIL");
    }

    queue_init(ps_input_queue);
#endif
}

uint8_t ps3_receive(int16_t* outputs)
{
#ifdef HAS_BLUETOOTH
    if (!Ps3.isConnected()) {
        return 0;
    }
    ps3_t data;
    
    if (queue_receive(ps_input_queue, data))
    {
    #ifdef INPUT_PS3_RAW_DEBUG
        log_d("CPU%d Sticks: Left (%d,%d) Right (%d,%d) Triggers: (%d,%d)", 
            xPortGetCoreID(),

            data.analog.stick.lx,
            data.analog.stick.ly,
            
            data.analog.stick.rx,
            data.analog.stick.ry,
            
            data.analog.button.l2,
            data.analog.button.r2
        );
    #endif

        // Data_t data = { 
        //     Ps3.data.analog.stick.lx, 
        //     Ps3.data.analog.stick.ly,
        //     Ps3.data.analog.stick.rx,
        //     Ps3.data.analog.stick.ry,

        //     Ps3.data.analog.button.l2,
        //     Ps3.data.analog.button.r2,
        //     Ps3.data.analog.button.l1,
        //     Ps3.data.analog.button.r1,

        //     Ps3.data.analog.button.left,
        //     Ps3.data.analog.button.up,
        //     Ps3.data.analog.button.right,
        //     Ps3.data.analog.button.down,

        //     Ps3.data.analog.button.square,
        //     Ps3.data.analog.button.triangle,
        //     Ps3.data.analog.button.circle,
        //     Ps3.data.analog.button.cross 
        // };

        int16_t values[] = {
            ps3_trim(data.analog.stick.lx), 
            ps3_trim(data.analog.stick.ly),
            ps3_trim(data.analog.stick.rx),
            ps3_trim(data.analog.stick.ry),

            (ps3_trim(data.analog.button.l2) - ps3_trim(data.analog.button.r2)) / 2,
            (ps3_trim(data.analog.button.l1) - ps3_trim(data.analog.button.r1)) / 2,

            (data.analog.button.up - data.analog.button.down) / 2,
            (data.analog.button.left - data.analog.button.right) / 2,

            data.analog.button.square,
            data.analog.button.triangle,
            data.analog.button.circle,
            data.analog.button.cross 
        };

        auto values_count = sizeof(values) / sizeof(int16_t);

    #ifdef INPUT_PS3_DEBUG
        log_d_values("[PS3] ", values, values_count);
    #endif

        // TODO: test this
        memcpy(outputs, values, sizeof(values));
        return values_count;
    }

    return false;

#else
    return false;
#endif
}